---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
source: html/2566d441-9e7e-2c9e-df94-1d1b7fd0ade4.htm
---
# FilterGlobalParameterAssociationRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.